app/Http/Helpers/Helpers.php

select * from `settings` limit 1
---
    function get_setting($key)
    {
        $settings = Setting::first();

select * from `system_settings`
---
    function sys_setting($key, $default = null)
    {
        $settings = SystemSetting::all();