app/Http/Controllers/Back/AdminController.php

select * from `users` where `blocked` = 0 and `user_role` = 'user' order by `id` desc
select * from `deposits` order by `id` desc
select * from `mdeposits` order by `id` desc
select * from `network_trxes` order by `id` desc
select * from `transactions` order by `id` desc
---
    function index(){
        $users = User::whereBlocked(0)->whereUserRole('user')->orderByDesc('id')->get();
        $deposit = Deposit::orderByDesc('id')->get();
        $mpayment = Mdeposit::orderByDesc('id')->get();
        $networktrx = NetworkTrx::orderByDesc('id')->get();
        $transactions = Transaction::orderByDesc('id')->get();

select * from `pages`
---
    public function pages ()
    {
        $pages = Page::all();

select * from `users` where `user_role` = 'user' and `blocked` = 0 order by `id` desc
---
    public function users()
    {
        $users = User::where('user_role' ,'user')->whereBlocked(0)->orderByDesc('id')->get();