app/Http/Controllers/Back/SalesController.php

    function deposits()
    {
        $deposits = Deposit::orderByDesc('id')->get();
---
select * from `deposits` order by `id` desc