app/Http/Controllers/UserController.php

    public function transactions(){
        $transactions = Transaction::whereUserId(Auth::user()->id)->orderByDesc('updated_at')->get();
---
select * from `transactions` where `user_id` = 4 order by `updated_at` desc